app/controllers/api/v1/itemreservations_controller.rb

  def show
    items = Item.find(params[:id])
    item_reservations = ItemReservation.where(item: items).includes(:reservation)
    list = []
    item_reservations.each do |item_reservation|
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "item_reservations".* FROM "item_reservations" WHERE "item_reservations"."item_id" = $1  [["item_id", 9]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" IN ($1, $2)  [["id", 12], ["id", 13]]