app/controllers/api/v1/items_controller.rb

  def create
    user = User.find(params[:user_id])
    new_item = user.items.new(items_params)
    if new_item.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "items" ("created_at", "updated_at", "name", "description", "image", "price", "city", "capacity", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def destroy
    item = Item.find(params[:id])
    if item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]