app/controllers/api/v1/reservations_controller.rb

SELECT "item_reservations".* FROM "item_reservations" WHERE "item_reservations"."reservation_id" IN ($1, $2, $3, $4, $5)  [["reservation_id", 1], ["reservation_id", 2], ["reservation_id", 3], ["reservation_id", 4], ["reservation_id", 5]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "item_reservations".* FROM "item_reservations" WHERE "item_reservations"."reservation_id" IN ($1, $2)  [["reservation_id", 3], ["reservation_id", 4]]
---
  def index
    reservations = User.first.reservations.includes(:item_reservations)
    list = []
    reservations.each do |reservation|
      reservation.item_reservations.each { |item_reserve| list << { reservation: reservation.as_json(only: [:id, :start_date, :end_date]), item: item_reserve.item.as_json(only: [:id, :name, :capacity, :price, :city, :description, :image]) }}

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "item_reservations" ("created_at", "updated_at", "item_id", "reservation_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-03-30 08:15:54.338933"], ["updated_at", "2022-03-30 08:15:54.338933"], ["item_id", 1], ["reservation_id", 6]]
INSERT INTO "reservations" ("created_at", "updated_at", "user_id", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2022-03-30 08:15:52.575023"], ["updated_at", "2022-03-30 08:15:52.575023"], ["user_id", 1], ["start_date", "2022-03-31"], ["end_date", "2022-04-02"]]
---
  def create
    reserved_item = Item.find(params[:item_id])
    reservation_made = User.first.reservations.new(start_date: params[:start_date], end_date: params[:end_date])
    item_reservation = ItemReservation.new(reservation: reservation_made, item: reserved_item)
    if item_reservation.save

SELECT "item_reservations".* FROM "item_reservations" WHERE "item_reservations"."reservation_id" = $1  [["reservation_id", 6]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "item_reservations" WHERE "item_reservations"."id" = $1  [["id", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 6]]
---
  def destroy
    reservation = Reservation.find(params[:id])
    if reservation.destroy